ycsb-0.14.0/workloada_run_res.txt
fields: null
fields: null
fields: null
[...]
[OVERALL], RunTime(ms), 7676
[OVERALL], Throughput(ops/sec), 130.27618551328817
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 6
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0781657113079729
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 6
[TOTAL_GC_TIME_%], Time(%), 0.0781657113079729
[READ], Operations, 150
[READ], AverageLatency(us), 7380.973333333333
[READ], MinLatency(us), 2632
[READ], MaxLatency(us), 18383
[READ], 95thPercentileLatency(us), 14159
[READ], 99thPercentileLatency(us), 16911
[READ], Return=OK, 150
[READ], Return=NOT_FOUND, 316
[UPDATE-FAILED], Operations, 7
[UPDATE-FAILED], AverageLatency(us), 2018084.5714285714
[UPDATE-FAILED], MinLatency(us), 2001920
[UPDATE-FAILED], MaxLatency(us), 2038783
[UPDATE-FAILED], 95thPercentileLatency(us), 2038783
[UPDATE-FAILED], 99thPercentileLatency(us), 2038783
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 221698.0
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 2217983
[CLEANUP], 95thPercentileLatency(us), 2217983
[CLEANUP], 99thPercentileLatency(us), 2217983
[READ-FAILED], Operations, 316
[READ-FAILED], AverageLatency(us), 7536.278481012659
[READ-FAILED], MinLatency(us), 1322
[READ-FAILED], MaxLatency(us), 32479
[READ-FAILED], 95thPercentileLatency(us), 14495
[READ-FAILED], 99thPercentileLatency(us), 30863
[UPDATE], Operations, 527
[UPDATE], AverageLatency(us), 55530.10436432638
[UPDATE], MinLatency(us), 1800
[UPDATE], MaxLatency(us), 3987455
[UPDATE], 95thPercentileLatency(us), 16247
[UPDATE], 99thPercentileLatency(us), 1943551
[UPDATE], Return=OK, 527
[UPDATE], Return=ERROR, 7